import sys
sys.stdout.reconfigure(encoding='utf-8')

locs = [
    ("១",  "ធម្មសាលាសភា",                  156, 428, "building", "R"),
    ("២",  "មហាកុដិ",                       182, 520, "building", "R"),
    ("៣",  "កុដិសាឡុម",                     142, 673, "building", "R"),
    ("៤",  "កុដិតូច",                       43,  342, "building", "R"),
    ("៥",  "កុដិថ្មី",                      157, 259, "building", "L"),
    ("៦",  "កុដិគ្រូធំ",                   235, 259, "building", "R"),
    ("៧",  "ព្រះវិហារ",                     362, 524, "building", "A"),
    ("៨",  "ដើមពោធិព្រឹក្ស",               348, 636, "building", "R"),
    ("៩",  "បណ្ណាល័យ",                     568, 523, "building", "R"),
    ("១០", "ពុទ្ឌកបឋមសិក្សាកម្រងហ៊ុនណេង", 565, 430, "building", "B"),
    ("១១", "កុដិយាយតា",                    421, 258, "building", "L"),
    ("១២", "ប៉ុស្តវិទ្យុ",                 523, 209, "building", "L"),
    ("១៣", "អាងទឹក",                       640, 283, "building", "R"),
    ("១៤", "អាងទឹកវិទ្យុ",                603, 183, "building", "R"),
    ("១៥", "ព្រះផ្ទំ",                      627, 351, "building", "R"),
    ("១៦", "ចេតីយឧកញ៉ា ចាយ ស៊ាងអ៊ី",              514, 759, "building", "B"),
    ("A",  "ក្លោងទ្វារទី១",               740, 61,  "gate",     "L"),
    ("B",  "ក្លោងទ្វារទី២",               278, 186, "gate",     "B"),
    ("C",  "ក្លោងទ្វារទី៣",               907, 536, "gate",     "L"),
    ("D",  "ក្លោងទ្វារទី៤",               706, 683, "gate",     "L"),
    ("E",  "ក្លោងទ្វារទី៥",               41,  452, "gate",     "R")
]

for item in locs:
    xp = round(item[2] / 966.0 * 100, 2)
    yp = round(item[3] / 966.0 * 100, 2)
    print(f'{{ id: "{item[0]}", name: "{item[1]}", x: {xp}, y: {yp}, type: "{item[4]}", pos: "{item[5]}" }},')
